#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + canonicalization_method             = "EXCLUSIVE"
      + client_id                           = "GENESYS-TRAINING"
      + client_signature_required           = false
      + description                         = "Contact Center as a Service (CCaaS) Genesys CX Cloud contact center solution. Training environment."
      + enabled                             = true
      + encrypt_assertions                  = false
      + encryption_certificate              = (known after apply)
      + encryption_certificate_sha1         = (known after apply)
      + force_name_id_format                = false
      + force_post_binding                  = true
      + front_channel_logout                = true
      + full_scope_allowed                  = false
      + id                                  = (known after apply)
      + include_authn_statement             = true
      + logout_service_post_binding_url     = "https://login.cac1.pure.cloud/saml/logout"
      + logout_service_redirect_binding_url = "https://login.cac1.pure.cloud/saml/logout"
      + name                                = "GENESYS TRAINING"
      + name_id_format                      = "persistent"
      + realm_id                            = "moh_applications"
      + sign_assertions                     = false
      + sign_documents                      = true
      + signature_algorithm                 = "RSA_SHA256"
      + signature_key_name                  = "NONE"
      + signing_certificate                 = (known after apply)
      + signing_certificate_sha1            = (known after apply)
      + signing_private_key                 = (known after apply)
      + signing_private_key_sha1            = (known after apply)
      + valid_redirect_uris                 = [
          + "https://apps.cac1.pure.cloud/*",
          + "https://login.cac1.pure.cloud/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.GENESYS-TRAINING.keycloak_saml_user_attribute_protocol_mapper.saml_user_attribute_mapper will be created
  + resource "keycloak_saml_user_attribute_protocol_mapper" "saml_user_attribute_mapper" {
      + client_id                  = (known after apply)
      + friendly_name              = "email"
      + id                         = (known after apply)
      + name                       = "email"
      + realm_id                   = "moh_applications"
      + saml_attribute_name        = "email"
      + saml_attribute_name_format = "Basic"
      + user_attribute             = "email"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HCIMWEB_HIAT1.module.payara-client.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "65461959-dd7f-4584-a2cd-711a7fdb3a6b"
        name                                       = "HCIMWEB HIAT1"
      ~ use_refresh_tokens                         = true -> false
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HCIMWEB_HIAT2.module.payara-client.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "8ea594ee-7f95-4ed5-900f-160f6b2dad8e"
        name                                       = "HCIMWEB HIAT2"
      ~ use_refresh_tokens                         = true -> false
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HCIMWEB_HIAT3.module.payara-client.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "51ab04d5-fc15-4081-96db-9ee9275a0945"
        name                                       = "HCIMWEB HIAT3"
      ~ use_refresh_tokens                         = true -> false
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HCIMWEB_HS1.module.payara-client.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "42ea603b-11a3-4c63-8097-b4b39ac46cd4"
        name                                       = "HCIMWEB HS1 - Staging"
      ~ use_refresh_tokens                         = true -> false
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HCIMWEB_HSIT.module.payara-client.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "e2ad0f2c-0b2c-44df-845f-401529ce514f"
        name                                       = "HCIMWEB HSIT"
      ~ use_refresh_tokens                         = true -> false
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HCIMWEB_HUAT.module.payara-client.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "a11031dc-4c8a-480d-832a-ecdccf660a61"
        name                                       = "HCIMWEB HUAT"
      ~ use_refresh_tokens                         = true -> false
        # (25 unchanged attributes hidden)
    }

Plan: 3 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*